---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConstructionIsSchematic
source: html/3c62865d-fbe6-ecf0-2a05-dcf80319a169.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConstructionIsSchematic Property

"Schematic"

## Syntax (C#)
```csharp
public static ForgeTypeId ConstructionIsSchematic { get; }
```